'''
Найдите последнюю цифру числа
'''
a = int(input())
print(a % 10)
print()
