"""
Дано целое число N. Выведите следующее за ним четное число.
"""
n = 10

print(n + (2 - (n % 2)))
