'''
Найдите последнюю цифру числа
'''
a = int(input())
print(a % (a // 10))
print()
